In [10]:
import pandas as pd
import numpy as np

from sklearn.ensemble import RandomForestClassifier

from interpret.blackbox import LimeTabular
from interpret import show
np.random.seed(222)

In [11]:
dane = pd.read_csv("titanic.csv", index_col=0)
dane.shape

dane.head(10)

   gender   age  class  embarked     fare  sibsp  parch  survived
0       1  42.0      2         3   7.1100      0      0         0
1       1  13.0      2         3  20.0500      0      2         0
2       1  16.0      2         3  20.0500      1      1         0
3       0  39.0      2         3  20.0500      1      1         1
4       0  16.0      2         3   7.1300      0      0         1
5       1  25.0      2         3   7.1300      0      0         1
6       1  30.0      1         1  24.0000      1      0         0
7       0  28.0      1         1  24.0000      1      0         1
8       1  27.0      2         1  18.1509      0      0         1
9       1  20.0      2         3   7.1806      0      0         1

In [20]:
# 1176 - Gender 1 Age 74 Class 2 Survived 0
dane.sort_values(by=['age','gender','survived'], ascending=False).head(1)

      gender   age  class  embarked    fare  sibsp  parch  survived
1176       1  74.0      2         3  7.1506      0      0         0

In [21]:
# 316 - Gender 0 Age 0.16 Class 2 Survived 1
dane.sort_values(by=['age','gender','survived'], ascending=True).head(1)

     gender       age  class  embarked     fare  sibsp  parch  survived
316       0  0.166667      2         3  20.1106      1      2         1

In [22]:
# 23 - Gender 0 Age 2.0 Class 0 Survived 0
dane.sort_values(by=['class','survived'], ascending=True).head(1)

    gender  age  class  embarked    fare  sibsp  parch  survived
23       0  2.0      0         3  151.16      1      2         0

In [23]:
# 1335 - Gender 1 Age 19 Class 6 Survived 1
dane.sort_values(by=['class','survived'], ascending=False).head(1)

      gender   age  class  embarked  fare  sibsp  parch  survived
1335       1  19.0      6         3   0.0      0      0         1

In [26]:
X = dane.loc[: , dane.columns != 'survived']
y = dane['survived']
crew_ids = [1176,316,23,1335]

rf = RandomForestClassifier(n_estimators=100)
rf.fit(X, y)
lime_inter = LimeTabular(predict_fn=rf.predict_proba, data=X, random_state=100)

X_przypadki = X.filter(items = crew_ids, axis=0)
y_przypadki = rf.predict(X) 

inter_lokal = lime_inter.explain_local(
    X_przypadki, y_przypadki, name='lime')
show(inter_lokal)

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

/Users/lswarss/Code/StudySpace/ML_Data_Analysis/env/lib/python3.10/site-packages/sklearn/base.py:450: UserWarning:

X does not have valid feature names, but RandomForestClassifier was fitted with feature names

# Osoba 1 - 1176
## Klasa 2 Plec 1 Przeżył 0 Wiek 74

Predykcja dla pierwszej osoby jest trafna. Model przewiduje że umrze a na jej korzyśc przemawia iloś czlonkow rodziny na pokładzie czyli 0. Co może mocno korelowac z tym ze to najstarsza osoba na pokładzie.

# Osoba 2 - 316
## Klasa 2 Plec 0 Przeżyła 1 Wiek 0.16

Predykcja dla drugiej osoby wskazuje na to że jej współczynniki nie wskazywały na pierwszy rzut oka na to że przeżyje ale klasa była tutaj czynnikiem który spowodował że jednak tak się stało.

# Osoba 3 - 23
## Klasa 0 Plec 0 Przeżyła 0 Wiek 2.0

W wypadku trzeciej osoby model przewiduje jej śmierc z powodu niskiej klasy bo aż 0 oraz osoba jest bardzo młoda co napewno z sobą dodatkowo koreluje.

# Osoba 4 - 1135
## Klasa 6 Plec 1 Przeżył 1 Wiek 19

W wypadku ostatniej osoby model przewiduje że przeżyje i tutaj najmocnjenszymi wyznacznikami jest wysoka klasa i wiek wskazujący na wejście w najbardziej sprawną fizycznie częsc zycia.